app/controllers/players_controller.rb

  def index
    all_players = Player.all
---
SELECT "players".* FROM "players"