app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    all_teams = Team.all