app/controllers/trades_controller.rb

SELECT "trades".* FROM "trades"
---
  def index
    all_trades = Trade.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "trades" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2020-03-13 22:42:23.649954"], ["updated_at", "2020-03-13 22:42:23.649954"]]
---
  def create
    user = User.find_by(id: params[:user]["id"])
    trade = Trade.create(user:user)

INSERT INTO "swaps" ("trade_id", "player_id", "created_at", "updated_at", "team_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trade_id", 6], ["player_id", 1737], ["created_at", "2020-03-13 22:43:51.988974"], ["updated_at", "2020-03-13 22:43:51.988974"], ["team_id", 1530]]
---
  def create_swaps(swaps, trade)
   swaps.each do |swapped|
      swapped[1].each{|player| Swap.create(trade_id: trade.id, player_id: player["id"], team_id: swapped[0]["id"])}

SELECT "trades".* FROM "trades" WHERE "trades"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def destroy
    trade = Trade.find_by(id: params[:id])