app/controllers/trades_controller.rb

SELECT "swaps".* FROM "swaps" WHERE "swaps"."trade_id" = $1  [["trade_id", 1]]
---
  def create_swaps(swaps, trade)
   swaps.each do |swapped|
      swapped[1].each{|player| Swap.create(trade_id: trade.id, player_id: player["id"], team_id: swapped[0]["id"])}